app/controllers/book_controller.rb

def show_subjects
@sujects=Subject.find(params[:id])
---
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2)